<?php
// +----------------------------------------------------------------------
// |
// +----------------------------------------------------------------------
// |
// +----------------------------------------------------------------------
// |
// +----------------------------------------------------------------------
// | Author: wls
// +----------------------------------------------------------------------

/**
 * 模块语言包-西班牙语
 * @author   wls
 *
 * @version  0.0.1
 * @datetime 2016-12-01T21:51:08+0800
 */
return [
    // 文章
    'article'           => [
        'article_no_data_tips'                  => 'El artículo no existe o ha sido eliminado',
        'article_id_params_tips'                => 'El ID del artículo es incorrecto',
    ],
    // 订单管理
    'order'             => [
        'form_you_have_commented_tips'          => 'Ya has comentado',
    ],
];
?>